{
  "backend/main.mo": "Main actor defining user-specific data structures and CRUD operations for tasks, goals, calendar entries, budgets, profiles, and crypto with access control and task–calendar syncing.",
  "backend/migration.mo": "Migration module converting old calendar entries to the new format by adding taskId and recurrence fields while preserving other actor state.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries describing the purpose of each frontend file across components, hooks, pages, and utilities.",
  "frontend/index.css": "Tailwind base/theme definitions providing color variables, dark mode values, and global styling rules.",
  "frontend/index.html": "HTML entry point defining the root container and loading the React application script.",
  "frontend/src/App.tsx": "Root React app configuring theme, query client, router, and route structure for all main pages.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling Internet Identity login/logout with loading state and cache clearing.",
  "frontend/src/components/auth/RequireAuth.tsx": "Route guard managing authentication flow, profile setup prompting, and fallback loading or welcome screens.",
  "frontend/src/components/auth/UserProfileSetup.tsx": "Renders a profile setup form allowing users to enter and save their name using a mutation hook.",
  "frontend/src/components/budget/BudgetItemFormDialog.tsx": "Dialog form for creating or editing budget items with fields for type, amount, description, and date, supporting backend mutations.",
  "frontend/src/components/budget/BudgetSummary.tsx": "Displays income, expenses, and net balance summaries with filtering by month or all time.",
  "frontend/src/components/calendar/CalendarEntryFormDialog.tsx": "Dialog form for creating or editing calendar entries or synced tasks with fields for times, recurrence, and type.",
  "frontend/src/components/calendar/CalendarEntryList.tsx": "Lists calendar entries with sorting, edit/delete actions, recurrence badges, and an empty state with examples.",
  "frontend/src/components/calendar/CalendarViewSelector.tsx": "Dropdown selector for choosing between year, month, or week calendar views.",
  "frontend/src/components/calendar/views/MonthCalendarView.tsx": "Renders a monthly calendar grid with navigation and indicators for scheduled days and the current day.",
  "frontend/src/components/calendar/views/WeekCalendarView.tsx": "Renders a week calendar with navigation and clickable days showing events and today's highlight.",
  "frontend/src/components/calendar/views/YearCalendarView.tsx": "Displays an annual month grid with day cells, event markers, and optional day click handling.",
  "frontend/src/components/common/IntegrityWarningBanner.tsx": "Shows a destructive alert banner with an integrity warning message.",
  "frontend/src/components/common/PrivacyStatusBar.tsx": "Displays a security status bar based on authentication state using Internet Identity.",
  "frontend/src/components/common/SectionExamples.tsx": "Shows example templates for a section with titles and descriptions inside a card.",
  "frontend/src/components/common/SecurityNote.tsx": "Displays a small alert noting encryption and secure login requirements.",
  "frontend/src/components/crypto/CryptoEntryFormDialog.tsx": "Dialog form for creating or editing crypto positions with live price fetching and validation.",
  "frontend/src/components/crypto/CryptoEntryList.tsx": "Lists crypto positions with live prices, edit/delete actions, and example placeholders when empty.",
  "frontend/src/components/crypto/CryptoSummary.tsx": "Computes and displays overall crypto portfolio stats and per-asset profit/loss using live prices.",
  "frontend/src/components/dashboard/DashboardSummaries.tsx": "Aggregates and displays summary blocks for tasks, goals, calendar events, and budget items based on user preferences.",
  "frontend/src/components/dashboard/DashboardSummarySettingsDropdown.tsx": "Provides a dropdown UI for enabling dashboard summary sections and selecting their display modes.",
  "frontend/src/components/dashboard/DashboardSummaryToggles.tsx": "Renders a card with toggles and mode selectors for each dashboard summary section.",
  "frontend/src/components/dashboard/MarketSummarySection.tsx": "Displays market data tables for crypto, stocks, and commodities with loading and error states.",
  "frontend/src/components/dashboard/SectionSummaryBlock.tsx": "Reusable summary card showing stats, optional secondary text, and loading or empty states.",
  "frontend/src/components/goals/GoalFormDialog.tsx": "Modal form for creating or editing goals, handling input state and submission to goal APIs.",
  "frontend/src/components/goals/GoalList.tsx": "Lists goals with progress controls, edit/delete actions, and an empty-state example display.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout wrapper with header, navigation, mobile menu, authentication handling, and routed content.",
  "frontend/src/components/tasks/TaskFormDialog.tsx": "Dialog form for creating or editing tasks, handling description, due date, and task type selection with synced mutations.",
  "frontend/src/components/tasks/TaskList.tsx": "Renders a flat list of tasks with completion toggling, deletion, and edit dialog support.",
  "frontend/src/components/tasks/TaskSectionedList.tsx": "Displays tasks grouped by type (daily, weekend, day-of-week) with controls for edit, delete, and completion.",
  "frontend/src/hooks/budget/useBudget.ts": "React Query hooks for CRUD operations on budget items through the backend actor.",
  "frontend/src/hooks/budget/useBudgetSummaryPeriod.ts": "Stores and updates the selected budget summary period using localStorage.",
  "frontend/src/hooks/calendar/useCalendar.ts": "React Query hooks for fetching and managing calendar entries, including creating, updating, and deleting.",
  "frontend/src/hooks/calendar/useCalendarViewPreference.ts": "Manages the user's calendar view preference with persistent localStorage storage.",
  "frontend/src/hooks/crypto/useCrypto.ts": "React Query hooks for CRUD operations on crypto portfolio entries via backend actor.",
  "frontend/src/hooks/crypto/useCryptoLivePrices.ts": "Fetches live crypto prices from CoinGecko for one or multiple symbols with normalization and caching.",
  "frontend/src/hooks/dashboard/useDashboardSummaryPreferences.ts": "Manages dashboard section preferences with localStorage persistence and provides toggling and mode‑setting helpers.",
  "frontend/src/hooks/goals/useGoals.ts": "Provides React Query hooks for fetching and mutating goals via the backend actor, with automatic cache invalidation.",
  "frontend/src/hooks/integrity/useIntegrityVerifier.ts": "Computes placeholder integrity verification status for data items, currently always returning no issues.",
  "frontend/src/hooks/market/useMarketSummary.ts": "Fetches crypto, stocks, and commodity market data using React Query, using a real API for crypto and mock data for others.",
  "frontend/src/hooks/sync/useTaskCalendarSync.ts": "Defines mutations to create, update, and delete tasks and calendar entries while keeping both task and calendar queries synced.",
  "frontend/src/hooks/tasks/useTasks.ts": "Provides React Query hooks for CRUD operations on tasks with cache invalidation for related calendar entries.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor and triggers refetching of dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state and provides login, logout, and identity context to the app.",
  "frontend/src/hooks/useQueries.ts": "Exposes hooks to fetch and save the caller’s user profile through the backend actor with query invalidation.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for theming, including light/dark mode and component styles like privacy status bars.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers, rendering the root App component.",
  "frontend/src/pages/BudgetPage.tsx": "Displays and manages budget items with CRUD actions, integrity checks, summaries, and a transaction table.",
  "frontend/src/pages/CalendarPage.tsx": "Shows calendar entries with switchable year, month, and week views, integrity checks, and an event creation dialog.",
  "frontend/src/pages/CryptoPage.tsx": "Renders crypto portfolio entries, a summary, and a dialog for adding positions.",
  "frontend/src/pages/DashboardPage.tsx": "Aggregates summaries for tasks, goals, calendar, and budget, plus quick-access links and market info.",
  "frontend/src/pages/GoalsPage.tsx": "Manages user goals with listing, integrity checks, and a form dialog for adding goals.",
  "frontend/src/pages/TasksPage.tsx": "Displays tasks grouped by sections with integrity checks and a dialog for adding new tasks.",
  "frontend/src/utils/calendar/dateBuckets.ts": "Provides utilities for converting timestamps to day keys and generating day lists for months, weeks, and years.",
  "frontend/src/utils/calendar/entryIndicators.ts": "Builds a set of scheduled days from calendar entries, including recurrence handling.",
  "frontend/src/utils/calendar/recurrence.ts": "Generates date strings for recurring events within a range based on daily, weekly, monthly, or yearly intervals.",
  "frontend/src/utils/crypto/profitLoss.ts": "Computes profit/loss for crypto entries and aggregates totals per asset and portfolio.",
  "frontend/src/utils/dashboard/summaryComputations.ts": "Builds task, goal, calendar, and budget summaries including counts, recent items, and formatted stats.",
  "frontend/src/utils/integrity/canonicalize.ts": "Produces canonical JSON strings for tasks, goals, calendar entries, and budget items for integrity checks.",
  "frontend/src/utils/integrity/salts.ts": "Generates, stores, retrieves, and clears per‑principal salts in localStorage for data integrity.",
  "frontend/src/utils/integrity/sha256.ts": "Computes a SHA‑256 hex digest from a string using Web Crypto.",
  "frontend/src/utils/money.ts": "Provides helpers to convert between dollars and cents and format cents as USD currency.",
  "frontend/src/utils/tasks/taskTypeLabel.ts": "Maps task types to sections and returns human‑readable labels for task sections and days of the week.",
  "frontend/src/utils/urlParams.ts": "Handles URL and sessionStorage parameters, including reading, storing, persisting, and clearing them.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, typography, animations, and content paths for the frontend.",
  "project_state.json": "Defines the project’s current version, feature scope, architectural requirements, known issues, and image needs for expanding an ‘everything tracker’ app. Includes detailed feature list, privacy constraints, and planned integrations for crypto, stocks, and commodities."
}