{
  "backend/main.mo": "Main canister actor defining user-specific state for tasks, goals, calendar, budget, profiles, and crypto, with access control and CRUD entry points.",
  "backend/migration.mo": "Migration module converting old actor state to new format by adding an empty crypto portfolio map.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Reference file containing prewritten summaries for all frontend source files.",
  "frontend/index.css": "Tailwind CSS configuration defining light and dark theme variables and base styles.",
  "frontend/index.html": "HTML entry point loading the root React app via main.tsx.",
  "frontend/src/App.tsx": "Application root configuring TanStack Router, React Query, theming, routes, and global error UI.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with loading and retry handling.",
  "frontend/src/components/auth/RequireAuth.tsx": "Route guard enforcing authentication and profile setup before rendering protected routes.",
  "frontend/src/components/auth/UserProfileSetup.tsx": "Form for entering and saving a user's name using a profile mutation with basic validation and toast feedback.",
  "frontend/src/components/budget/BudgetItemFormDialog.tsx": "Dialog for creating or editing budget items, handling amount, description, date, and type with validation and backend mutations.",
  "frontend/src/components/budget/BudgetSummary.tsx": "Displays monthly income, expenses, and net balance using computed totals from budget items.",
  "frontend/src/components/calendar/CalendarEntryFormDialog.tsx": "Dialog for creating or editing calendar events, managing title, description, date, and time fields with validation and mutations.",
  "frontend/src/components/calendar/CalendarEntryList.tsx": "Lists calendar events with sorting, edit/delete actions, empty-state examples, and a form dialog for editing entries.",
  "frontend/src/components/common/IntegrityWarningBanner.tsx": "Shows a destructive alert banner displaying an integrity warning message.",
  "frontend/src/components/common/PrivacyStatusBar.tsx": "Displays a security status bar showing whether the user is authenticated via Internet Identity.",
  "frontend/src/components/common/SectionExamples.tsx": "Renders a card listing example templates for a given section with titles and optional descriptions.",
  "frontend/src/components/common/SecurityNote.tsx": "Displays a small alert noting that entries are protected with encryption and require secure login.",
  "frontend/src/components/crypto/CryptoEntryFormDialog.tsx": "Dialog for adding or editing crypto portfolio positions with validation and create/update mutations.",
  "frontend/src/components/crypto/CryptoEntryList.tsx": "Renders a list of crypto positions with value calculations, edit and delete actions, and loading/empty states.",
  "frontend/src/components/crypto/CryptoSummary.tsx": "Computes and displays total positions, unique assets, and total portfolio value in summary cards.",
  "frontend/src/components/dashboard/DashboardSummaries.tsx": "Aggregates and displays summary blocks for tasks, goals, calendar, and budget based on user preferences.",
  "frontend/src/components/dashboard/DashboardSummaryToggles.tsx": "Provides UI controls to enable/disable dashboard sections and select summary modes for each.",
  "frontend/src/components/dashboard/SectionSummaryBlock.tsx": "Reusable summary block showing stats, loading placeholders, or empty messages with an icon.",
  "frontend/src/components/goals/GoalFormDialog.tsx": "Modal form for creating or editing goals, handling input state, validation, and submit mutations.",
  "frontend/src/components/goals/GoalList.tsx": "Displays goals with progress controls, edit/delete actions, and loading/empty states with examples.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main app layout with header, navigation, mobile menu, footer, and outlet rendering based on authentication state.",
  "frontend/src/components/tasks/TaskFormDialog.tsx": "Modal form for creating or editing tasks, handling description, optional due date, and submitting mutations.",
  "frontend/src/components/tasks/TaskList.tsx": "Displays task list with completion toggles, edit/delete actions, empty-state examples, and opens the task form dialog.",
  "frontend/src/hooks/budget/useBudget.ts": "React Query hooks for CRUD operations on budget items via the actor API.",
  "frontend/src/hooks/calendar/useCalendar.ts": "React Query hooks to fetch and manage calendar entries including create, update, and delete.",
  "frontend/src/hooks/crypto/useCrypto.ts": "Provides React Query hooks for managing crypto portfolio entries with CRUD mutations.",
  "frontend/src/hooks/dashboard/useDashboardSummaryPreferences.ts": "Manages dashboard summary preferences with localStorage persistence and section/mode toggles.",
  "frontend/src/hooks/goals/useGoals.ts": "React Query hooks for fetching and mutating goals, including progress updates and deletion.",
  "frontend/src/hooks/integrity/useIntegrityVerifier.ts": "Stub integrity-check hook that always reports no issues while preparing for future digest-based verification.",
  "frontend/src/hooks/tasks/useTasks.ts": "Provides React Query hooks for fetching and mutating task data through the actor API, with automatic cache invalidation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider for login, logout, and identity restoration using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Exposes React Query hooks for loading and saving the caller's user profile with automatic cache updates.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables, and component styles including light/dark themes and custom UI elements.",
  "frontend/src/main.tsx": "Initializes the app by setting up React Query and Internet Identity providers before rendering the root component.",
  "frontend/src/pages/BudgetPage.tsx": "Renders the budget management interface with item listing, creation/editing dialogs, integrity checks, and summary components.",
  "frontend/src/pages/CalendarPage.tsx": "Displays calendar entries with integrity warnings, listing, and dialog-based event creation.",
  "frontend/src/pages/CryptoPage.tsx": "Shows crypto portfolio data with summary, list, and dialog to add positions, styled with a crypto theme.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard view fetching tasks, goals, calendar, and budget data, rendering summaries and quick-access cards.",
  "frontend/src/pages/GoalsPage.tsx": "Page for viewing and managing goals with integrity checks, list display, and goal creation dialog.",
  "frontend/src/pages/TasksPage.tsx": "Page for listing and creating tasks with integrity verification and a task form dialog.",
  "frontend/src/utils/dashboard/summaryComputations.ts": "Provides functions to compute summary stats for tasks, goals, calendar entries, and budget items based on selected mode.",
  "frontend/src/utils/integrity/canonicalize.ts": "Converts tasks, goals, calendar entries, and budget items into canonical JSON strings for integrity checking.",
  "frontend/src/utils/integrity/salts.ts": "Manages per-user salted values in localStorage for integrity hashing, including generation and clearing.",
  "frontend/src/utils/integrity/sha256.ts": "Computes SHA-256 digests of strings using Web Crypto API.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL parameters with session persistence and hash support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, fonts, and plugins.",
  "project_state.json": "Defines the current project state, emphasizing a shift to a mobile-first organizer with privacy, UI theming, and new tracking areas, plus known issues and a list of implemented features. Includes architectural notes on security and design direction."
}