{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Tasks↔Calendar sync, recurring calendar entries, dashboard market summary, hero header, and crypto P/L UI",
  "requirements": [
    {
      "id": "REQ-27",
      "summary": "Bi-directional Tasks↔Calendar sync for dated items with consistent create/edit/delete behavior in the UI.",
      "acceptanceCriteria": [
        "Creating a Task with a due date results in a corresponding Calendar item showing on the correct day in Year/Month/Week calendar views and in the Calendar list.",
        "Creating a Calendar item designated as a Task results in a corresponding Task item appearing in the Tasks page with the correct due date.",
        "Editing a synced Task’s description and/or due date updates the linked Calendar item’s title/date accordingly.",
        "Editing a synced Calendar task’s title/date updates the linked Task’s description/due date accordingly.",
        "Deleting a synced Task removes (or clearly unlinks) its linked Calendar item; deleting a synced Calendar task removes (or clearly unlinks) its linked Task, with no orphaned linked references remaining.",
        "Sync behavior is per-user and respects existing access control rules (a user never sees another user’s synced items)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/calendar/useCalendar.ts",
          "operation": "modify",
          "description": "Update calendar mutations to pass/receive task linkage fields required for Tasks↔Calendar sync (ensure create/update support recurrence and optional taskId)."
        },
        {
          "path": "frontend/src/hooks/tasks/useTasks.ts",
          "operation": "modify",
          "description": "Invalidate calendar queries when task mutations succeed (create/update/delete) to keep synced views consistent in the UI."
        },
        {
          "path": "frontend/src/hooks/sync/useTaskCalendarSync.ts",
          "operation": "create",
          "description": "Add a dedicated sync hook that orchestrates cross-feature mutations (create task+linked calendar entry, update both sides, delete/unlink both sides) using existing react-query hooks/actor calls. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/tasks/TaskFormDialog.tsx",
          "operation": "modify",
          "description": "When a task has a due date, invoke the sync hook so creating/updating a task also creates/updates the linked calendar item (and removing a due date unlinks/stops syncing as designed). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/tasks/TaskList.tsx",
          "operation": "modify",
          "description": "Route task edit/delete actions through the sync hook so deleting a synced task removes/unlinks its calendar counterpart (no orphaned linked references in UI). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/TasksPage.tsx",
          "operation": "modify",
          "description": "Wire the sync behavior into the Tasks page flow (ensure the page uses the synced delete/edit handlers so Tasks and Calendar remain consistent)."
        }
      ]
    },
    {
      "id": "REQ-28",
      "summary": "Add recurring calendar entries (weekly/monthly/yearly) in create/edit flow and reflect occurrences in calendar views and list.",
      "acceptanceCriteria": [
        "Calendar entry create/edit UI includes a recurrence control with options: None, Weekly, Monthly, Yearly.",
        "Recurring selection is saved with the calendar entry and persists across reloads.",
        "Calendar views (year/month/week) visibly mark days that have at least one occurrence generated by a recurring entry.",
        "Calendar list view clearly indicates that an entry is recurring and its recurrence frequency.",
        "If recurrence is removed on an existing entry, future occurrences stop appearing while the base entry remains as a single scheduled item on its start date."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/calendar/CalendarEntryFormDialog.tsx",
          "operation": "modify",
          "description": "Add a recurrence control (None/Weekly/Monthly/Yearly) to the calendar entry create/edit dialog and submit the selected recurrence via calendar mutations. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/calendar/useCalendar.ts",
          "operation": "modify",
          "description": "Ensure create/update calendar mutations accept and forward the recurrence value, and preserve it when editing existing entries."
        },
        {
          "path": "frontend/src/utils/calendar/recurrence.ts",
          "operation": "create",
          "description": "Add a small recurrence utility to compute occurrence day-keys for weekly/monthly/yearly entries over a provided date range (used by year/month/week views and list indicators)."
        },
        {
          "path": "frontend/src/utils/calendar/entryIndicators.ts",
          "operation": "modify",
          "description": "Extend scheduled-day computation to include occurrences generated from recurring entries (using the new recurrence utility) so Year/Month/Week views can mark days with occurrences."
        },
        {
          "path": "frontend/src/components/calendar/CalendarEntryList.tsx",
          "operation": "modify",
          "description": "Show a clear recurring indicator (e.g., badge/text) for entries with recurrence and display the selected frequency in the list. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/CalendarPage.tsx",
          "operation": "modify",
          "description": "Ensure calendar views receive occurrence-aware scheduled day indicators so recurring items mark the correct days in year/month/week modes."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Add a dashboard “market summary” section showing top 10 Crypto, Stocks, and Commodities with client-side fetch + loading/error states.",
      "acceptanceCriteria": [
        "Dashboard shows a clearly labeled market summary section with three lists/tables: Crypto (10), Stocks (10), Commodities (10).",
        "Each row shows at minimum: symbol/name and current price (USD).",
        "Data is fetched client-side with loading and error states; if a category cannot be fetched, the UI shows a clear fallback message while the rest of the dashboard still renders.",
        "The market summary does not require user authentication to render the layout, but only fetches data when appropriate for the app’s existing behavior (no infinite retries or blocking the page)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/market/useMarketSummary.ts",
          "operation": "create",
          "description": "Create a client-side hook that fetches top-10 lists for Crypto/Stocks/Commodities with explicit loading/error states and no infinite retries (use react-query with sensible staleTime/retry settings)."
        },
        {
          "path": "frontend/src/components/dashboard/MarketSummarySection.tsx",
          "operation": "create",
          "description": "Create a dashboard section component that renders three labeled tables/lists (Crypto/Stocks/Commodities), each with symbol/name + USD price, plus per-category loading/error/fallback messaging. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Wire the MarketSummarySection into the Dashboard page so it renders as an additional section without changing unrelated existing dashboard summaries. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-30",
      "summary": "Modernize the global header with large branded title “The Everything Tracker” and a static hero background image with accessible contrast.",
      "acceptanceCriteria": [
        "The global header (AppShell) includes a prominent “The Everything Tracker” title in a modern style.",
        "A static background hero image is visible behind/within the header area without reducing readability of navigation and auth controls.",
        "Header remains responsive: mobile shows a clean layout with the existing hamburger/sheet behavior; desktop shows navigation links as before.",
        "Text contrast and accessibility remain acceptable (no unreadable nav text over the hero image)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/header-city-desk-hero.dim_1920x640.png",
          "operation": "create",
          "description": "Add the required generated hero image asset at frontend/public/assets/generated/header-city-desk-hero.dim_1920x640.png (served statically; do not route through backend)."
        },
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Update the header to a hero-style layout: prominent “The Everything Tracker” title, background using frontend/public/assets/generated/header-city-desk-hero.dim_1920x640.png, and maintain existing desktop nav + mobile Sheet behavior with readable contrast. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add/adjust global Tailwind component classes used by the hero header (overlay/contrast, responsive spacing) to keep navigation/auth controls accessible over the background image."
        }
      ]
    },
    {
      "id": "REQ-31",
      "summary": "Enhance Crypto page with total portfolio profit/loss and per-asset profit status listing using live prices (or stored currentPriceCents fallback).",
      "acceptanceCriteria": [
        "Crypto page shows a total profit/loss value (USD) for the portfolio based on (currentPrice - purchasePrice) * amount, using the same unit scaling already used for portfolio value.",
        "Crypto summary area no longer presents “Unique Assets” as a primary stat; instead, a “Profit Status” section/list is shown summarizing each asset’s profit/loss (positive/negative/flat) and its P/L amount (USD) or percent (at least USD).",
        "Per-asset profit/loss is computed using live prices from the existing live price hook when available, otherwise falling back to the stored currentPriceCents.",
        "The per-asset profit/loss status is clearly visually differentiated (e.g., positive vs negative styling) and remains readable in the existing crypto theme."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/crypto/profitLoss.ts",
          "operation": "create",
          "description": "Add shared helpers to compute per-entry and per-asset profit/loss in USD using amount unit scaling consistent with existing portfolio value computation and using live price when available."
        },
        {
          "path": "frontend/src/components/crypto/CryptoSummary.tsx",
          "operation": "modify",
          "description": "Replace “Unique Assets” stat with (1) total portfolio profit/loss (USD) and (2) a “Profit Status” per-asset listing using live prices when available, otherwise stored currentPriceCents; apply clear positive/negative/flat styling. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add minimal crypto-theme utility classes for positive/negative/flat P/L styling that remain readable in the existing crypto theme (no changes to shadcn ui primitives)."
        }
      ]
    },
    {
      "id": "REQ-32",
      "summary": "Update Calendar create/edit UI to choose entry type (Task vs Event) so calendar-created tasks participate in Tasks↔Calendar sync while events remain calendar-only.",
      "acceptanceCriteria": [
        "Calendar entry form includes a clear control to select entry type: Event or Task.",
        "When entry type is Task, the form creates/updates a synced Task as described in REQ-27; when entry type is Event, it creates/updates only a calendar item (no Task created).",
        "Editing an existing calendar entry preserves and displays its type (Task vs Event)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/calendar/CalendarEntryFormDialog.tsx",
          "operation": "modify",
          "description": "Add an entry type control (Event vs Task) to the calendar entry dialog; when Task is selected (or editing an entry that is already linked), route submit through the sync hook; when Event is selected, keep calendar-only behavior. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/calendar/CalendarEntryList.tsx",
          "operation": "modify",
          "description": "Visually distinguish Task-type calendar entries vs Events in the list (e.g., label/badge) and ensure edit opens with the correct preserved type. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/CalendarPage.tsx",
          "operation": "modify",
          "description": "Update Calendar page button copy and wiring so the create flow supports both Events and Tasks without adding new routes/pages, while keeping existing view selector behavior intact."
        },
        {
          "path": "frontend/src/hooks/sync/useTaskCalendarSync.ts",
          "operation": "modify",
          "description": "Extend the sync hook to support calendar-created tasks: create/update/delete/unlink rules for entries marked as Task vs Event, preserving type on edit and keeping queries consistent."
        }
      ]
    }
  ]
}